Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: CICD|Only this project and any groups and projects in the allowlist
sv: CICD|Endast det här projektet samt grupper och projekt på tillåtelselistan

source: CICD|Select the groups and projects authorized to use a CI/CD job token to authenticate requests to this project. %{linkStart}Learn more%{linkEnd}.
sv: CICD|Välj de grupper och projekt som har behörighet att använda en CI/CD-jobbtoken för att autentisera begäranden till det här projektet. %{linkStart}Läs mer%{linkEnd}.

source: CredentialsInventory|Personal access tokens
sv: CredentialsInventory|Personliga åtkomsttoken

source: CredentialsInventory|Project and group access tokens
sv: CredentialsInventory|Projekt- och gruppåtkomsttoken

source: Members|Direct member
sv: Members|Direkt medlem

source: Members|Inherited from %{group}
sv: Members|Ärvd från %{group}

source: Members|Invited group %{group}
sv: Members|Inbjuden grupp %{group}

source: MergeRequest|Awaiting review
sv: MergeRequest|Väntar på granskning

source: MergeRequest|Change reviewer
sv: MergeRequest|Byt granskare

source: MergeRequest|Remove reviewer
sv: MergeRequest|Ta bort granskare

source: MergeRequest|Reviewer approved changes
sv: MergeRequest|Granskaren godkände ändringarna

source: MergeRequest|Reviewer commented
sv: MergeRequest|Granskaren kommenterade

source: MergeRequest|Reviewer requested changes
sv: MergeRequest|Granskaren begärde ändringar

source: MergeRequest|Reviewer started review
sv: MergeRequest|Granskaren startade granskningen

source: ProtectedEnvironments|Set which groups, access levels, or users are required to approve in this environment tier.
sv: ProtectedEnvironments|Ange vilka grupper, åtkomstnivåer eller användare som måste godkänna i den här miljönivån.

source: ProtectedEnvironments|Set which groups, access levels, or users can deploy in this environment tier.
sv: ProtectedEnvironments|Ange vilka grupper, åtkomstnivåer eller användare som kan driftsätta i den här miljönivån.

source: Your account is authenticated with SSO or SAML. To push and pull over %{protocol} with Git using this account, you must %{set_password_link_start}set a password%{link_end} or %{set_up_pat_link_start}set up a personal access token%{link_end} to use instead of a password.
sv: Ditt konto är autentiserat med SSO eller SAML. För att skicka upp och hämta över %{protocol} med Git med det här kontot måste du %{set_password_link_start}ange ett lösenord%{link_end} eller %{set_up_pat_link_start}konfigurera en personlig åtkomsttoken%{link_end} som används i stället för ett lösenord.

source: Your account is authenticated with SSO or SAML. To push and pull over %{protocol} with Git using this account, you must %{set_up_pat_link_start}set up a personal access token%{link_end} to use instead of a password.
sv: Ditt konto är autentiserat med SSO eller SAML. För att skicka upp och hämta över %{protocol} med Git med det här kontot måste du %{set_up_pat_link_start}konfigurera en personlig åtkomsttoken%{link_end} som används i stället för ett lösenord.

source: Todos|Unmergeable
sv: Todos|Kan inte sammanfogas

source: DeployTokens|Enter a unique name for your deploy token. Name the token gitlab-deploy-token to expose it to CI/CD jobs.
sv: DeployTokens|Ange ett unikt namn för din driftsättningstoken. Döp token till gitlab-deploy-token för att exponera den för CI/CD-jobb.

source: ProtectedEnvironments|This rule already exists.
sv: ProtectedEnvironments|Den här regeln finns redan.

source: Members|Role promotions must be approved by an administrator. This setting can be changed in the Admin area. %{linkStart}Learn more%{linkEnd}.
sv: Members|Rollbefordringar måste godkännas av en administratör. Inställningen kan ändras i administratörsområdet. %{linkStart}Läs mer%{linkEnd}.

source: ProtectedEnvironments|Approvers
sv: ProtectedEnvironments|Godkännare

source: ProtectedEnvironments|This environment has no approval rules set up. %{linkStart}Learn more about deployment approvals.%{linkEnd}
sv: ProtectedEnvironments|Den här miljön har inga konfigurerade godkännanderegler. %{linkStart}Läs mer om godkännanden för driftsättning.%{linkEnd}

source: GroupSettings|Change saved.
sv: GroupSettings|Ändringen sparades.

source: Are you sure you want to delete this WebAuthn device?
sv: Är du säker på att du vill ta bort den här WebAuthn-enheten?

source: CICD|Configure CI/CD job token settings for all projects.
sv: CICD|Konfigurera inställningar för CI/CD-jobbtoken för alla projekt.

source: CICD|Enable and enforce job token allowlist for all projects.
sv: CICD|Aktivera och tillämpa tillåtelselistan för jobbtoken för alla projekt.

source: ComplianceStandardsAdherence|Have SAST scanner configured in pipeline configuration
sv: ComplianceStandardsAdherence|Ha SAST-skannern konfigurerad i pipelinekonfigurationen

source: ComplianceStandardsAdherence|SAST scan
sv: ComplianceStandardsAdherence|SAST-skanning

source: ComplianceStandardsAdherence|SAST scanner is not configured in the pipeline configuration for the default branch.
sv: ComplianceStandardsAdherence|SAST-skannern är inte konfigurerad i pipelinekonfigurationen för standardgrenen.

source: ComplianceStandardsAdherence|DAST scan
sv: ComplianceStandardsAdherence|DAST-skanning

source: ComplianceStandardsAdherence|DAST scanner is configured in the pipeline configuration for the default branch.
sv: ComplianceStandardsAdherence|DAST-skannern är konfigurerad i pipelinekonfigurationen för standardgrenen.

source: ComplianceStandardsAdherence|DAST scanner is not configured in the pipeline configuration for the default branch.
sv: ComplianceStandardsAdherence|DAST-skannern är inte konfigurerad i pipelinekonfigurationen för standardgrenen.

source: ComplianceStandardsAdherence|SAST scanner is configured in the pipeline configuration for the default branch.
sv: ComplianceStandardsAdherence|SAST-skannern är konfigurerad i pipelinekonfigurationen för standardgrenen.

source: MergeRequests|Merge can start
sv: MergeRequests|Sammanfogning kan starta

source: MergeRequests|Requires that merge checks pass.
sv: MergeRequests|Kräver att sammanfogningskontrollerna godkänns.

source: ComplianceStandardsAdherence|Enable DAST scanner
sv: ComplianceStandardsAdherence|Aktivera DAST-skanner

source: ComplianceStandardsAdherence|Enable SAST scanner
sv: ComplianceStandardsAdherence|Aktivera SAST-skannern

source: DastProfiles| Customize the behavior of DAST using additional variables. For a full list of available variables, refer to the %{linkStart}DAST documentation%{linkEnd}.
sv: DastProfiles|Anpassa DAST:s beteende med ytterligare variabler. En fullständig lista över tillgängliga variabler finns i %{linkStart}DAST-dokumentationen%{linkEnd}.

source: DastProfiles|Additional variables
sv: DastProfiles|Ytterligare variabler

source: DastProfiles|Add DAST variable
sv: DastProfiles|Lägg till DAST-variabel

source: DastProfiles|No variables found
sv: DastProfiles|Inga variabler hittades

source: DastProfiles|Select a variable
sv: DastProfiles|Välj en variabel

source: DastProfiles|The maximum amount of time to wait for the active scan phase of the scan to complete. Defaults to 3h.
sv: DastProfiles|Maximal tid som väntas på att den aktiva skanningsfasen ska slutföras. Standardvärdet är 3 h.

source: DastProfiles|The number of active checks to run in parallel. Defaults to 3.
sv: DastProfiles|Antal aktiva kontroller som körs parallellt. Standardvärdet är 3.

source: DastProfiles|Variable
sv: DastProfiles|Variabel

source: CICD|Are you sure you want to remove %{namespace} from the job token allowlist?
sv: CICD|Är du säker på att du vill ta bort %{namespace} från tillåtelselistan för jobbtoken?

source: CICD|Are you sure you want to remove %{namespace} from the job token allowlist? This action cannot be undone.
sv: CICD|Är du säker på att du vill ta bort %{namespace} från tillåtelselistan för jobbtoken? Åtgärden kan inte ångras.

source: CICD|Automatic pipeline cleanup
sv: CICD|Automatisk rensning av pipelines

source: CICD|Remove group or project
sv: CICD|Ta bort grupp eller projekt

source: CICD|%{policy} to %{resource}
sv: CICD|%{policy} för %{resource}

source: CICD|Job token permissions
sv: CICD|Behörigheter för jobbtoken

source: CICD|No resources selected (minimal access only)
sv: CICD|Inga resurser är valda (endast minimal åtkomst)

source: DastProfiles|Field must not be blank
sv: DastProfiles|Fältet får inte vara tomt

source: DastProfiles|Edit DAST variable
sv: DastProfiles|Redigera DAST-variabel

source: DastProfiles|Update variable
sv: DastProfiles|Uppdatera variabel

source: DastProfiles|Active scan timeout
sv: DastProfiles|Tidsgräns för aktiv skanning

source: DastProfiles|Active scan worker count
sv: DastProfiles|Antal arbetare för aktiv skanning

source: DastProfiles|After-login actions
sv: DastProfiles|Åtgärder efter inloggning

source: DastProfiles|Before-login actions
sv: DastProfiles|Åtgärder före inloggning

source: DastProfiles|Clear input fields
sv: DastProfiles|Rensa inmatningsfält

source: DastProfiles|A cookie name and value to be added to every request.
sv: DastProfiles|Ett cookienamn och ett cookie-värde som läggs till i varje begäran.

source: DastProfiles|A selector describing the element that is clicked on to submit the username form of a multi-page login process.
sv: DastProfiles|En väljare som beskriver elementet som klickas för att skicka användarnamnsformuläret i en inloggningsprocess med flera sidor.

source: DastProfiles|Advertise scan
sv: DastProfiles|Annonsera skanning

source: DastProfiles|Allowed hosts
sv: DastProfiles|Tillåtna värdar

source: DastProfiles|Comma-separated list of selectors that are ignored when scanning.
sv: DastProfiles|Kommaseparerad lista över väljare som ignoreras vid skanning.

source: DastProfiles|Cookie names
sv: DastProfiles|Cookienamn

source: DastProfiles|DOM ready timeout
sv: DastProfiles|Tidsgräns för när DOM är redo

source: DastProfiles|DOM stable timeout
sv: DastProfiles|Tidsgräns för stabil DOM

source: DastProfiles|Define how long to wait for updates to the DOM before checking a page is stable. Defaults to `500ms`.
sv: DastProfiles|Ange hur länge uppdateringar av DOM ska inväntas innan en sida kontrolleras som stabil. Standardvärdet är `500ms`.

source: DastProfiles|Excluded elements
sv: DastProfiles|Undantagna element

source: DastProfiles|Excluded hosts
sv: DastProfiles|Undantagna värdar

source: DastProfiles|First submit field
sv: DastProfiles|Första inskickningsfältet

source: DastProfiles|Hostnames included in this variable are accessed, not attacked, and not reported against.
sv: DastProfiles|Värdnamn som ingår i den här variabeln nås, angrips inte och rapporteras inte.

source: DastProfiles|Hostnames included in this variable are considered excluded and connections are forcibly dropped.
sv: DastProfiles|Värdnamn som ingår i den här variabeln betraktas som undantagna och anslutningar avbryts med tvång.

source: DastProfiles|Ignored hosts
sv: DastProfiles|Ignorerade värdar

source: DastProfiles|Loading element
sv: DastProfiles|Inläsningselement

source: DastProfiles|Maximum action count
sv: DastProfiles|Maximalt antal åtgärder

source: DastProfiles|Maximum action depth
sv: DastProfiles|Maximalt åtgärdsdjup

source: DastProfiles|Maximum response size (MB)
sv: DastProfiles|Maximal svarsstorlek (MB)

source: DastProfiles|Number of workers that passive scan in parallel. Defaults to the number of available CPUs.
sv: DastProfiles|Antal arbetare som utför passiv skanning parallellt. Standardvärdet är antalet tillgängliga processorer.

source: DastProfiles|PKCS12 certificate
sv: DastProfiles|PKCS12-certifikat

source: DastProfiles|Page ready timeout
sv: DastProfiles|Tidsgräns för när sidan är redo

source: DastProfiles|Page ready timeout (after action)
sv: DastProfiles|Tidsgräns för när sidan är redo (efter åtgärd)

source: DastProfiles|Page ready timeout (after navigation)
sv: DastProfiles|Tidsgräns för när sidan är redo (efter navigering)

source: DastProfiles|Passive scan worker count
sv: DastProfiles|Antal arbetare för passiv skanning

source: DastProfiles|Ready element
sv: DastProfiles|Redo-element

source: DastProfiles|Request cookies
sv: DastProfiles|Begärandecookies

source: DastProfiles|Selector that when detected as visible on the page, indicates to the analyzer that the page has finished loading and the scan can continue. Cannot be used with `DAST_PAGE_IS_LOADING_ELEMENT`.
sv: DastProfiles|Väljare som, när den upptäcks som synlig på sidan, anger för analysverktyget att sidan har lästs in och att skanningen kan fortsätta. Kan inte användas med `DAST_PAGE_IS_LOADING_ELEMENT`.

source: DastProfiles|Selector that, when no longer visible on the page, indicates to the analyzer that the page has finished loading and the scan can continue. Cannot be used with `DAST_PAGE_IS_READY_ELEMENT`.
sv: DastProfiles|Väljare som, när den inte längre syns på sidan, anger för analysverktyget att sidan har lästs in och att skanningen kan fortsätta. Kan inte användas med `DAST_PAGE_IS_READY_ELEMENT`.

source: DastProfiles|Set to `true` to prevent DAST from checking that the target is available before scanning. Default: `false`.
sv: DastProfiles|Ange `true` för att förhindra att DAST kontrollerar att målet är tillgängligt före skanning. Standardvärdet är `false`.

source: DastProfiles|Skip target check
sv: DastProfiles|Hoppa över målkontroll

source: DastProfiles|Success URL
sv: DastProfiles|URL för lyckat resultat

source: DastProfiles|Success element
sv: DastProfiles|Element för lyckat resultat

source: DastProfiles|Success without login form
sv: DastProfiles|Lyckat resultat utan inloggningsformulär

source: DastProfiles|Target check timeout
sv: DastProfiles|Tidsgräns för målkontroll

source: DastProfiles|Target paths
sv: DastProfiles|Målsökvägar

source: DastProfiles|Target paths file
sv: DastProfiles|Fil med målsökvägar

source: DastProfiles|The PKCS12 certificate used for sites that require Mutual TLS. Must be encoded as base64 text.
sv: DastProfiles|PKCS12-certifikatet som används för webbplatser som kräver ömsesidig TLS. Måste vara kodat som base64-text.

source: DastProfiles|The maximum amount of time to wait for a browser to consider a page loaded and ready for analysis after a navigation completes. Defaults to `6s`.
sv: DastProfiles|Maximal tid som webbläsaren väntar efter avslutad navigering innan sidan betraktas som inläst och klar för analys. Standardvärdet är `6s`.

source: DastProfiles|The maximum amount of time to wait for a browser to consider a page loaded and ready for analysis. Defaults to `7s`.
sv: DastProfiles|Maximal tid som webbläsaren väntar innan sidan betraktas som inläst och klar för analys. Standardvärdet är `7s`.

source: DastProfiles|The maximum amount of time to wait for a browser to navigate from one page to another. Defaults to `15s`.
sv: DastProfiles|Maximal tid som webbläsaren väntar för att navigera från en sida till en annan. Standardvärdet är `15s`.

source: DastProfiles|The maximum amount of time to wait for an element before determining it is ready for analysis. Defaults to `300ms`.
sv: DastProfiles|Maximal tid som väntas på ett element innan det bedöms vara klart för analys. Standardvärdet är `300ms`.

source: DastProfiles|The maximum amount of time to wait for the crawl phase of the scan to complete. Defaults to `24h`.
sv: DastProfiles|Maximal tid som väntas på att genomsökningsfasen ska slutföras. Standardvärdet är `24h`.

source: DastProfiles|The maximum number of actions that the crawler performs. Example actions include selecting a link, or filling out a form. Defaults to `10000`.
sv: DastProfiles|Maximalt antal åtgärder som genomsökaren utför. Exempel är att välja en länk eller fylla i ett formulär. Standardvärdet är `10000`.

source: DastProfiles|The maximum number of chained actions that the crawler takes. For example, `Click, Form Fill, Click` is a depth of three. Defaults to `10`.
sv: DastProfiles|Maximalt antal sammankopplade åtgärder som genomsökaren utför. Till exempel har `Click, Form Fill, Click` djupet tre. Standardvärdet är `10`.

source: DastProfiles|The maximum size of a HTTP response body. Responses with bodies larger than this are blocked by the browser. Defaults to `10` MB.
sv: DastProfiles|Maximal storlek på en HTTP-svarstext. Svar med större texter blockeras av webbläsaren. Standardvärdet är `10` MB.

source: DastProfiles|Time limit in seconds to wait for target availability. Default: `60s`.
sv: DastProfiles|Tidsgräns i sekunder för att vänta på målets tillgänglighet. Standardvärdet är `60s`.

source: DastProfiles|Timeout
sv: DastProfiles|Tidsgräns

source: DastProfiles|Use cache
sv: DastProfiles|Använd cache

source: DastProfiles|Worker count
sv: DastProfiles|Antal arbetare

source: CredentialsInventory|GPG keys
sv: CredentialsInventory|GPG-nycklar

source: CredentialsInventory|Revoked
sv: CredentialsInventory|Återkallad

source: CredentialsInventory|SSH keys
sv: CredentialsInventory|SSH-nycklar

source: CredentialsInventory|Type
sv: CredentialsInventory|Typ

source: CredentialsInventory|Expired
sv: CredentialsInventory|Utgången

source: CredentialsInventory|Revoke
sv: CredentialsInventory|Återkalla

source: Job|Download SAST report
sv: Job|Hämta SAST-rapport

source: Job|This artifact contains SAST scan results in JSON format.
sv: Job|Den här artefakten innehåller resultat från SAST-skanningen i JSON-format.

source: GroupSettings|Add additional webhook triggers for group access token expiration
sv: GroupSettings|Lägg till ytterligare webhookutlösare för utgång av gruppåtkomsttoken

source: ServiceAccounts|An error occurred while fetching the service accounts.
sv: ServiceAccounts|Ett fel uppstod när tjänstekontona skulle hämtas.

source: ServiceAccounts|Edit
sv: ServiceAccounts|Redigera

source: ServiceAccounts|Name
sv: ServiceAccounts|Namn

source: ServiceAccounts|Service accounts are non-human accounts that allow interactions between software applications, systems, or services. %{learnMore}
sv: ServiceAccounts|Tjänstekonton är icke-mänskliga konton som möjliggör interaktioner mellan programvaror, system eller tjänster. %{learnMore}

source: DastProfiles|A list of modules and their intended logging level for use in the file log.
sv: DastProfiles|En lista över moduler och deras avsedda loggnivå för användning i filloggen.

source: DastProfiles|A selector describing the element used to enter the username on the login form.
sv: DastProfiles|En väljare som beskriver elementet som används för att ange användarnamnet i inloggningsformuläret.

source: DastProfiles|Docker registry
sv: DastProfiles|Docker-register

source: DastProfiles|Excluded checks
sv: DastProfiles|Undantagna kontroller

source: DastProfiles|Included checks
sv: DastProfiles|Inkluderade kontroller

source: DastProfiles|Log browser output
sv: DastProfiles|Logga webbläsarens utdata

source: DastProfiles|Log file levels
sv: DastProfiles|Filloggnivåer

source: DastProfiles|Log file path
sv: DastProfiles|Sökväg till loggfil

source: DastProfiles|Log levels
sv: DastProfiles|Loggnivåer

source: DastProfiles|Log messages
sv: DastProfiles|Loggmeddelanden

source: DastProfiles|Set the Docker registry base address from which to download the analyzer.
sv: DastProfiles|Ange Docker-registrets basadress som analysverktyget ska hämtas från.

source: DastProfiles|Set to `true` to add a `Via: GitLab DAST %{version}` header to every request sent, advertising that the request was sent as part of a GitLab DAST scan. Default: `false`.
sv: DastProfiles|Ange `true` för att lägga till huvudet `Via: GitLab DAST %{version}` i varje begäran, vilket anger att begäran skickades som del av en GitLab DAST-skanning. Standardvärdet är `false`.

source: DastProfiles|Set to `true` to log Chromium `STDOUT` and `STDERR`.
sv: DastProfiles|Ange `true` för att logga Chromiums `STDOUT` och `STDERR`.

source: DastProfiles|Set to `true` to run both passive and active checks. Default is `false`.
sv: DastProfiles|Ange `true` för att köra både passiva och aktiva kontroller. Standardvärdet är `false`.

source: DastProfiles|Set to log protocol messages between DAST and the Chromium browser.
sv: DastProfiles|Ange för att logga protokollmeddelanden mellan DAST och Chromium-webbläsaren.

source: DastProfiles|Set to the path of the file log. Default is `gl-dast-scan.log`.
sv: DastProfiles|Ange sökvägen till filloggen. Standardvärdet är `gl-dast-scan.log`.

source: DastProfiles|Submit field
sv: DastProfiles|Inskickningsfält

source: DastProfiles|The URL of the website to scan.
sv: DastProfiles|URL:en till webbplatsen som ska skannas.

source: DastProfiles|The URLs to skip during the authenticated scan; comma-separated. Regular expression syntax can be used to match multiple URLs. For example, `.*` matches an arbitrary character sequence.
sv: DastProfiles|URL:erna som ska hoppas över under den autentiserade skanningen, kommaseparerade. Reguljära uttryck kan användas för att matcha flera URL:er. Till exempel matchar `.*` en godtycklig teckensekvens.

source: DastProfiles|The username to authenticate to in the website.
sv: DastProfiles|Användarnamnet som ska autentiseras på webbplatsen.

source: Incident|Timeline text…
sv: Incident|Tidslinjetext…

source: ServiceAccount|You are not authorized to update service accounts in this namespace.
sv: ServiceAccount|Du har inte behörighet att uppdatera tjänstekonton i den här namnrymden.

source: DependencyProxy|Credentials used to authenticate with Docker Hub when pulling images.
sv: DependencyProxy|Autentiseringsuppgifter som används för att autentisera mot Docker Hub när avbildningar hämtas.

source: DependencyProxy|Secret
sv: DependencyProxy|Hemlighet

source: AccessTokens|You can generate a personal access token for each application you use that needs access to the GitLab API. You can also use personal access tokens to authenticate against Git over HTTP. They are the only accepted password when you have Two-Factor Authentication (2FA) enabled.
sv: AccessTokens|Du kan skapa en personlig åtkomsttoken för varje applikation som behöver åtkomst till GitLab API. Du kan även använda personliga åtkomsttoken för att autentisera mot Git via HTTP. När tvåfaktorsautentisering (2FA) är aktiverad är en personlig åtkomsttoken det enda lösenord som godtas.

source: ContainerRegistry|With the container registry, every project can have its own space to store its Docker images. Push at least one Docker image in one of this group's projects in order to show up here. %{docLinkStart}More Information%{docLinkEnd}
sv: ContainerRegistry|Med containerregistret kan varje projekt ha ett eget utrymme för att lagra sina Docker-avbildningar. Skicka upp minst en Docker-avbildning till ett av projekten i den här gruppen för att den ska visas här. %{docLinkStart}Mer information%{docLinkEnd}

source: GroupSettings|Cannot update the path because there are projects under this group that contain Docker images in their container registry. Please remove the images from your projects first and try again.
sv: GroupSettings|Det går inte att uppdatera sökvägen eftersom det finns projekt under den här gruppen som innehåller Docker-avbildningar i sitt containerregister. Ta först bort avbildningarna från projekten och försök igen.

source: CredentialsInventory|Search or filter credentials…
sv: CredentialsInventory|Sök eller filtrera autentiseringsuppgifter…

source: ServiceAccounts|An error occurred while deleting the service account.
sv: ServiceAccounts|Ett fel uppstod när tjänstekontot skulle tas bort.

source: ServiceAccounts|The service account is being deleted.
sv: ServiceAccounts|Tjänstekontot håller på att tas bort.

source: DastProfiles|Default log level
sv: DastProfiles|Standardloggnivå
